package main

/*
给定一个数组，它的第 i 个元素是一支给定的股票在第 i 天的价格。
设计一个算法来计算你所能获取的最大利润。你最多可以完成 两笔 交易。
注意：你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。
示例 1:
输入：prices = [3,3,5,0,0,3,1,4]
输出：6
解释：在第 4 天（股票价格 = 0）的时候买入，在第 6 天（股票价格 = 3）的时候卖出，这笔交易所能获得利润 = 3-0 = 3 。

	随后，在第 7 天（股票价格 = 1）的时候买入，在第 8 天 （股票价格 = 4）的时候卖出，这笔交易所能获得利润 = 4-1 = 3 。

示例 2：
输入：prices = [1,2,3,4,5]
输出：4
解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5-1 = 4 。

	注意你不能在第 1 天和第 2 天接连购买股票，之后再将它们卖出。
	因为这样属于同时参与了多笔交易，你必须在再次购买前出售掉之前的股票。

示例 3：
输入：prices = [7,6,4,3,1]
输出：0
解释：在这个情况下, 没有交易完成, 所以最大利润为 0。
示例 4：
输入：prices = [1]
输出：0
提示：
1 <= prices.length <= 105
0 <= prices[i] <= 105
解题思路:
 1. 确定dp[i][j]的定义和下标的含义
    j = 0: 第i天不做任何买卖操作
    j = 1: 第i天第一次持有股票
    j = 2: 第i天第一次不持有股票
    j = 3: 第i天第二次持有股票
    j = 4: 第i天第二次不持有股票
 2. 确定动态转换方程式
    dp[i][0] = 0
    // 前一天不做任何买卖操作今天第一次买入   前一天进行第一次买入操作
    dp[i][1] = max(dp[i-1][0]-prices[i], dp[i-1][1])
    // 前一天第一次持有股票,今天第一次卖出   前一天进行第一次卖出股票不持有股票
    dp[i][2] = max(dp[i-1][1]+prices[i], dp[i-1][2])
    // 前一天进行第一次卖出今天进行第一次买入   前一天进行第二次买入
    dp[i][3] = max(dp[i-1][2]-prices[i], dp[i-1][3])
    // 前一天进行第二次卖出今天不进行任何操作  前一天进行第二次买入操作今天进行第二次卖出
    dp[i][4] = max(dp[i-1][4], dp[i-1][3]+prices[i])
 2. 初始化
    dp[0] = 0
    dp[1] = -prices[0]
    dp[2] = 0
    dp[3] = -prices[0]
    dp[4] = 0
*/
func maxProfitS1(prices []int) int {
	// 边界处理
	if len(prices) == 0 {
		return 0
	}
	// 创建动态规划二维数组
	dp := make([][]int, len(prices))
	for i, _ := range prices {
		dp[i] = make([]int, 5)
		if i == 0 {
			dp[i][0] = 0
		}
	}
	dp[0][1] = -prices[0]
	dp[0][2] = 0
	dp[0][3] = -prices[0]
	dp[0][4] = 0
	// 遍历
	for i := 1; i < len(prices); i++ {
		dp[i][1] = max(dp[i-1][1], dp[i-1][0]-prices[i])
		dp[i][2] = max(dp[i-1][2], dp[i-1][1]+prices[i])
		dp[i][3] = max(dp[i-1][3], dp[i-1][2]-prices[i])
		dp[i][4] = max(dp[i-1][4], dp[i-1][3]+prices[i])
	}
	return dp[len(dp)-1][4]
}
