package main

/*
给你一个只包含 '(' 和 ')' 的字符串，找出最长有效（格式正确且连续）括号 子串 的长度。
左右括号匹配，即每个左括号都有对应的右括号将其闭合的字符串是格式正确的，比如 "(()())"。
示例 1：
输入：s = "(()"
输出：2
解释：最长有效括号子串是 "()"
示例 2：
输入：s = ")()())"
输出：4
解释：最长有效括号子串是 "()()"
示例 3：
输入：s = ""
输出：0
提示：
0 <= s.length <= 3 * 104
s[i] 为 '(' 或 ')'
解题思路:
 1. 定义dp数组及下标含义
    dp[i]:以s[i]结尾的最长有效括号(连续且格式正确)的长度为dp[i]
 2. 推导递推公式
    格式通常有四种:
    (): dp[i] = dp[i-2]+2
    ((: dp[i] = 0
    )):
    如果 s[i - dp[i-1] - 1] = (: dp[i] = dp[i-1] + 2 + dp[i-dp[i-1]-1  -1]
    )(: dp[i] = 0
*/
// 最长有效括号: 动态规划一维数组
func longestValidParentheses(s string) int {
	// 计算长度
	l := len(s)
	// 创建一个动态规划一维数组
	dp := make([]int, l)
	// 创建一个结果变量
	ans := 0
	// 动态规划遍历
	for i := 1; i < l; i++ {
		if s[i-1] == '(' && s[i] == ')' {
			if i-2 > 0 {
				dp[i] = dp[i-2] + 2
			} else {
				dp[i] = 2
			}
		}
		if s[i] == '(' {
			dp[i] = 0
		}
		if s[i-1] == ')' && s[i] == ')' {
			iLeft := i - dp[i-1] - 1
			if iLeft >= 0 && s[iLeft] == '(' {
				dp[i] = dp[i-1] + 2
				if iLeft-1 >= 0 {
					dp[i] += dp[iLeft-1]
				}
			}
		}
		ans = max(dp[i], ans)
	}
	return ans
}
