package main

/*
给你一个整数数组 nums ，请你找出一个具有最大和的连续子数组（子数组最少包含一个元素），返回其最大和。
子数组是数组中的一个连续部分。
示例 1：
输入：nums = [-2,1,-3,4,-1,2,1,-5,4]
输出：6
解释：连续子数组 [4,-1,2,1] 的和最大，为 6 。
示例 2：
输入：nums = [1]
输出：1
示例 3：
输入：nums = [5,4,-1,7,8]
输出：23
提示：
1 <= nums.length <= 105
-104 <= nums[i] <= 104
进阶：如果你已经实现复杂度为 O(n) 的解法，尝试使用更为精妙的 分治法 求解。
解题思路:
1. 确认动态规划dp[i]的定义及下标的定义:(结尾型)
  dp[i]: 以nums[i]为结尾的最大连续子数组和为dp[i]
2. 推导递推公式
	dp[i] > 0: dp[i] = dp[i-1] + nums[i]
	dp[i] < 0: dp[i] = max(nums[i], dp[i-1] + nums[i])
    => dp[i] = max(dp[i-1] + nums[i], nums[i])
3. 初始化:
	dp[0] = nums[0]
4. 遍历顺序:
	一维遍历: 顺序遍历
题目要求连续序列的最大子序列和
如果nums[i]一定要选,那么就相当于这个子序列必须包含num[i]这个元素;
所以定义公式:
f[i]为以nums[i]结尾所构成的最大子序列和：
那么就可以分类讨论了:

	nums[i]单独是一个数组,f[i] = nums[i]
	nums[i]和前面子数组拼接, f[i] = f[i-1] + nums[i]; 其中f[i-1]为以nums[i-1]结尾所构成的最大子序列和

针对于上述的讨论能得出一个结论:
以nums[i]结尾所构成的最大子序列和就是:
f[i] = max(f[i-1], 0) + nums[i]
但这里有一个误区,这个公式只是说明以nums[i]结尾所构成的最大子序列和;并非说这个数组的最大子序列和就是f[i]

例如:
[-2, 1, -3, 4, -1, 2, 1, -5, 4]
f[0] = -2  -2
f[1] = 1 1 > 0  1
f[2] = -2 1-3 < 0    1
f[3] = 4 4 > 0  4
f[4] = 3
f[5] = 5
f[6] = 6
f[7] = 1
f[8] = 5
*/

// 最大子数组和: 动态规划一维数组
func maxSubArray(nums []int) int {
	// 统计数组长度
	l := len(nums)
	// 边界判断
	if l == 0 {
		return 0
	}
	// 创建动态规划一维数组
	dp := make([]int, l)
	// 动态规划初始化
	dp[0] = nums[0]
	// 定义一个结果变量
	ans := dp[0]
	// 动态规划一维数组遍历
	for i := 1; i < l; i++ {
		dp[i] = max(dp[i-1]+nums[i], nums[i])
		ans = max(ans, dp[i])
	}
	return ans
}
