package main

/*
整数数组的一个排列就是将其所有成员以序列或线性顺序排列。
例如，arr = [1,2,3] ，以下这些都可以视作 arr 的排列：[1,2,3]、[1,3,2]、[3,1,2]、[2,3,1] 。
整数数组的 下一个排列 是指其整数的下一个字典序更大的排列。更正式地，如果数组的所有排列根据其字典顺序从小到大排列在一个容器中，那么数组的 下一个排列 就是在这个有序容器中排在它后面的那个排列。如果不存在下一个更大的排列，那么这个数组必须重排为字典序最小的排列（即，其元素按升序排列）。
例如，arr = [1,2,3] 的下一个排列是 [1,3,2] 。
类似地，arr = [2,3,1] 的下一个排列是 [3,1,2] 。
而 arr = [3,2,1] 的下一个排列是 [1,2,3] ，因为 [3,2,1] 不存在一个字典序更大的排列。
给你一个整数数组 nums ，找出 nums 的下一个排列。
必须 原地 修改，只允许使用额外常数空间。
示例 1：
输入：nums = [1,2,3]
输出：[1,3,2]
示例 2：
输入：nums = [3,2,1]
输出：[1,2,3]
示例 3：
输入：nums = [1,1,5]
输出：[1,5,1]
提示：
1 <= nums.length <= 100
0 <= nums[i] <= 100
解题思路:
排列算法:
1, 2, 3 -> 1, 3, 2 -> 2, 1, 3 -> 2, 3, 1 -> 3, 1, 2 -> 3, 2, 1
算法推导: 4, 5, 2, 6, 3, 1
1. 以i=l-2为起点开始从右往左[0:]找，找到nums[i] < nums[i+1]; 保证nums[i+1:]为单调递减数组;设置该置换点为i
2. 以j=l-1为起点开始从右往左[i+1:]找，找到nums[j] > nums[i]；设置该点置换点为j
3. 更换i，j的所在位置的值
4. 将[i+1:]数组的元素重新通过翻转排成一个单调递增数组。
边界处理: 如果设置交换点i=-1，则只需要第四步进行翻转。
*/
// 下一个排列: 排列算法
func nextPermutation(nums []int) {
	// 计算数组长度
	l := len(nums)
	// 第一步: 从右到左找出第一个数字比其右边相邻的数字小(nums[i] >= nums[i+1])
	i := l - 2
	for i >= 0 && nums[i] >= nums[i+1] {
		i--
	}
	// i可能是-1或则>=0的数字
	if i >= 0 {
		// 从[i+1, l-1]找到比nums[i]大的数字的最小数字;[i+1, l-1]是递减数组
		j := l - 1
		for nums[j] <= nums[i] {
			j--
		}
		// 交换两者数字
		nums[i], nums[j] = nums[j], nums[i]
	}
	// 翻转[i+1:]为递增数组
	reverse(nums[i+1:])

}
func reverse(nums []int) {
	left, right := 0, len(nums)-1
	for left <= right {
		nums[left], nums[right] = nums[right], nums[left]
		left++
		right--
	}
}
