package main

/*
给定一个大小为 n 的数组 nums ，返回其中的多数元素。多数元素是指在数组中出现次数 大于 ⌊ n/2 ⌋ 的元素。
你可以假设数组是非空的，并且给定的数组总是存在多数元素。
示例 1：
输入：nums = [3,2,3]
输出：3
示例 2：
输入：nums = [2,2,1,1,1,2,2]
输出：2
提示：
n == nums.length
1 <= n <= 5 * 104
-109 <= nums[i] <= 109
输入保证数组中一定有一个多数元素。
进阶：尝试设计时间复杂度为 O(n)、空间复杂度为 O(1) 的算法解决此问题。
解题思路:
摩尔投票法（Boyer–Moore majority vote algorithm），也被称作「多数投票法」，算法解决的问题是：如何在任意多的候选人中（选票无序），选出获得票数最多的那个。
算法可以分为两个阶段：
对抗阶段：分属两个候选人的票数进行两两对抗抵消
计数阶段：计算对抗结果中最后留下的候选人票数是否有效
*/
// 多数元素: 摩尔投票法 + 众数>一半
func majorityElement(nums []int) int {
	var ans int
	count := 0
	for _, num := range nums {
		// 1, 1, 1, 2, 3, 4, 5: 这组数组不满足多数元素在数组中出现次数大于n/2的元素(摩尔投票的前提条件)
		if count == 0 {
			ans = num
		}
		if ans == num {
			count++
		} else {
			count--
		}
	}
	return ans
}
