package main

/*
你是一个专业的小偷，计划偷窃沿街的房屋，每间房内都藏有一定的现金。这个地方所有的房屋都围成一圈，这意味着第一个房屋和最后一个房屋是紧挨着的。
同时，相邻的房屋装有相互连通的防盗系统，如果两间相邻的房屋在同一晚上被小偷闯入，系统会自动报警 。
给定一个代表每个房屋存放金额的非负整数数组，计算你 在不触动警报装置的情况下 ，今晚能够偷窃到的最高金额。
示例 1：
输入：nums = [2,3,2]
输出：3
解释：你不能先偷窃 1 号房屋（金额 = 2），然后偷窃 3 号房屋（金额 = 2）, 因为他们是相邻的。
示例 2：
输入：nums = [1,2,3,1]
输出：4
解释：你可以先偷窃 1 号房屋（金额 = 1），然后偷窃 3 号房屋（金额 = 3）。
     偷窃到的最高金额 = 1 + 3 = 4 。
示例 3：
输入：nums = [1,2,3]
输出：3
提示：
1 <= nums.length <= 100
0 <= nums[i] <= 1000
解题思路:
1, 2, 3, 4, 5 个房间只会出现三种情况
第一种: 2, 3, 4
第二种: 1, 2, 3, 4
第三种: 2, 3, 4, 5
从这三种情况中进行打家劫舍; 而第一种又被第二种和第三种包含;所以只需要考虑第二种和第三种
*/

func rob2(nums []int) int {
	// 统计数字的长度
	l := len(nums)
	// 边界判断
	if l == 0 {
		return 0
	} else if l == 1 {
		return nums[0]
	} else if l == 2 {
		return max(nums[0], nums[1])
	}
	// 第二种情况:
	lNums := nums[:l-1]
	// 第三种情况:
	rNums := nums[1:]
	// 求出第二种情况的打家劫舍最大值
	lMax := rob(lNums)
	rMax := rob(rNums)
	return max(lMax, rMax)
}
