package main

/*
解题思路:
1. 乌龟赛跑原理, 创建两个指针,快指针和慢指针; 快指针一次性走2步;慢指针一次性走1步
2. 假设链表成环，慢指针走的总长度为b步;所以快指针走的总长度为2b步；两指针正式相遇
3. 假设环的长度为c;那么快指针一定是比慢指针多走了k个环的长度，才和慢指针相遇;多走的长度是kc
4. 所以能根据快指针和慢指针特性推算出 2b - b = kc  ==> 进而得到: b = kc
5. 假设从头节点到入环节点的长度为a
6. 那么从头节点到相遇节点就是慢指针走的长度: b
7. 进而推算出慢指针入环后走了长度: b - a; 又因为b = kc；所以慢指针入环后走了kc -a的长度
8. 说明慢指针从入环节点出发到和快指针相遇，走了kc-a的长度;kc是k倍的c长度环; -a刚好是倒退a步骤就是慢指针的相遇节点
9. 刚好头节点到入环节点的步骤也是为a
10. 所以慢指针从相遇节点再走a步就能到达入环节点，
11. 而头节点新创建的一个指针也走a步; 也能到达入环节点
12. 二则相遇即为入环节点;这样就避免a的长度计算问题
*/
func detectCycle(head *ListNode) *ListNode {
	// 创建快慢指针
	fast, slow := head, head
	for fast != nil && fast.Next != nil {
		// 快指针走两步
		fast = fast.Next.Next
		// 慢指针走一步
		slow = slow.Next
		// 判断是否两则会相遇
		if slow == fast {
			// 相遇后慢指针需要再走a步，又能够重新到达入环节点
			for slow != head {
				slow = slow.Next
				head = head.Next
			}
			return slow
		}
	}
	return nil
}
