package main

/*
给你一个整数数组 nums ，找到其中最长严格递增子序列的长度。
子序列 是由数组派生而来的序列，删除（或不删除）数组中的元素而不改变其余元素的顺序。例如，[3,6,2,7] 是数组 [0,3,1,6,2,2,7] 的子序列。
示例 1：
输入：nums = [10,9,2,5,3,7,101,18]
输出：4
解释：最长递增子序列是 [2,3,7,101]，因此长度为 4 。
示例 2：
输入：nums = [0,1,0,3,2,3]
输出：4
示例 3：
输入：nums = [7,7,7,7,7,7,7]
输出：1
提示：
1 <= nums.length <= 2500
-104 <= nums[i] <= 104
进阶：
你能将算法的时间复杂度降低到 O(n log(n)) 吗?
解题思路:
 1. 确定dp定义及下标的定义:以i结尾的最长递增序列(结尾型)
    dp[i]: 以nums[i]为结尾的最长严格递增子序列的长度
 2. 确定递推公式
    递增子序列不讲究连续,所以需要j
    位置i的最长递增子序列等于j从0-i-1各个位置的最长递增子序列+1的最大值
    dp[i]代表j从0->i-1各个位置的最长递增子序列的值
    if(nums[i] > nums[j]) dp[i] = max(dp[i], dp[j]+1)
 3. 初始化
    每个i对应的dp[i]初始化都应该为1
 4. 遍历顺序
*/
// 300_最长递增子序列: 一维数组
func lengthOfLIS(nums []int) int {
	// 边界处理
	if len(nums) == 0 {
		return 0
	}
	// 创建动态规划一维数组: dp[i]: 以nums[i]为结尾的最长严格递增子序列的长度
	dp := make([]int, len(nums))
	// 初始化
	for i := range dp {
		dp[i] = 1
	}
	// 定义最大值
	ans := dp[0]
	// 动态规划遍历
	for i := 1; i < len(nums); i++ {
		for j := 0; j < i; j++ {
			if nums[i] > nums[j] {
				dp[i] = max(dp[i], dp[j]+1)
			}
		}
		if dp[i] > ans {
			ans = dp[i]
		}
	}
	return ans
}
